Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G14.tmx
Source language: en_us
Languages: zh_cn

source: Meet the American Who Joined Mao's Revolution - War Is Boring - Medium
zh_cn: 于红更红：一个美国共产主义者的非常人生

source: Sidney Rittenberg greets me with a faint, friendly voice in the lobby of his condo building in Bellevue, Washington.
zh_cn: 李敦白在他位于华盛顿贝尔维尤的公寓里，用微弱温和的声音迎接了我。

source: Ninety three years old, wearing a striped blue polo shirt and khaki cargo pants, he walks slowly but appears remarkably healthy for his age.
zh_cn: 他93岁，穿着一件蓝色条纹的Polo衫和卡其工装裤，步履缓慢，但相对其年龄，显得异常健康。

source: If you didn't know his background, Rittenberg would come across as just another nonagenarian retiree in the Pacific Northwest.
zh_cn: 假如你不了解他的个人经历，那么李敦白给人的印象，不过是太平洋西北地区的又一个九十多岁的退休人员。

source: But he was the first American to join the Chinese Communist Party.
zh_cn: 然而，他是加入中国共产党的第一个美国人。

source: Once a U.S. Army linguist serving in China in the 1940s, he stayed behind after his enlistment ended, married twice, became a leader in the Cultural Revolution and spent 16 years in solitary confinement - and was once imprisoned because Joseph Stalin thought he was a spy.
zh_cn: 他曾经是上世纪40年代时，工作于中国的一位美国军队语言学家，在其服役期结束之后留了下来，结了两次婚，成为了文革中的指挥者，并被单独监禁了16年——且曾经因为斯大林认为他是一个间谍而入狱。

source: The former apparatchik translated several of Mao Zedong's writings, knew the Chinese leader personally and survived the purges and internecine political bloodshed that later swept through the country.
zh_cn: 这个前共产党官员翻译了数本毛泽东著作，与这位中国领导人有过私交，得以幸免于整肃运动以及随后席卷了这个国家的，具有毁灭性的政治喋血。

source: Disillusioned and returning to America with his family, he started a new life and became a respected academic.
zh_cn: 随着幻想的破灭，他和他的家人回到美国，开始了一段新的人生，成为了一位受人尊敬的学者。

source: In a sweeping interview, Rittenberg talked about his life, what drew him to the revolutionary movement and why he became disillusioned with it.
zh_cn: 在一次内容宽泛的访谈中，李敦白谈及了他的人生，是什么吸引他加入了革命运动，又为何对其失去信心。

source: Thanks to his unique experiences, he probably knows China better than any American alive today.
zh_cn: 归功于他独一无二的经历，他或许了解中国胜过于任何如今还在世的美国人。

source: Rittenberg and his wife, Yulin, recently sold their home on Fox Island in Pugent Sound and moved into this condo.
zh_cn: 李敦白和他的妻子王玉琳最近卖掉了他们在普吉特湾狐狸岛的家宅，搬到了这所公寓里。

source: They've had a little time to decorate, and the home is packed with boxes.
zh_cn: 他们还未抽出多少时间来进行装饰布置，家里堆满了箱子。

source: Chinese artwork and photos fill the hallways.
zh_cn: 中国工艺品和相册到处都是地堆放在过道里。

source: "We're trying to downsize right now," Rittenberg says.
zh_cn: “我们现在正想办法精简。”李敦白说。

source: Sunlight shines through large windows overlooking a scenic view of downtown Bellevue, with a glimpse of Lake Washington glistening in the distance.
zh_cn: 阳光透过宽大的窗户照射进来，远眺出去，是贝尔维尤市区优美的风景，可以瞥见远处泛着粼粼波光的华盛顿湖。

source: "The view is what sold us on this place."
zh_cn: “这个景观是这个地方给我们的卖点。”

source: He introduces me to Yulin, who is unpacking a box.
zh_cn: 他把我介绍给了正在打开一个箱子的王玉琳。

source: She offers us both tea. "Sit wherever you'll be comfortable," Rittenberg tells me.
zh_cn: 她给我们都端来了茶。“随便坐，你觉得舒服就行。”李敦白对我说。

source: I take a seat on the couch in the living room.
zh_cn: 我在客厅的沙发上坐了下来。

source: He gets comfortable in his rocking chair across from me.
zh_cn: 他惬意地坐在了我对面的摇椅里。

source: As we sit and drink tea, his iPad sits on the coffee table between us, which he uses to keep up with current events.
zh_cn: 在我们坐着喝茶时，他用来跟进时事的iPad摆放在了我们中间的咖啡桌上。

source: The years may have slowed him down physically, but not mentally.
zh_cn: 年龄或许于他在行动上有所放慢，但没有在心智上。

source: I tell him his experience with Chinese history is particularly unique.
zh_cn: 我对他说，他对于中国历史的亲身经历尤其地独一无二。

source: "I wouldn't recommend most of it," he replies.
zh_cn: “我不会建议其中的大多数内容。”他回答说。

source: Into the East
zh_cn: 远涉重洋

source: Rittenberg was born to a middle class Jewish family in Charleston, South Carolina.
zh_cn: 李敦白出生于美国南卡罗来纳州中产阶级的一户犹太人家庭里。

source: His involvement in political activism began there - in the Jim Crow South.
zh_cn: 他在政治运动上的参与起始于此——存在种族隔离的南方。

source: "When I was 13 or 14, I witnessed some terrible police brutality against a young black guy," he recalls.
zh_cn: “我在13还是14岁的时候，亲眼看到了警察对一个年轻黑人小伙实施的某种骇人暴行。”他回忆。

source: One night he witnessed a drunk white man attacking a black man, and ran to get the police.
zh_cn: 一天晚上，他目睹了一个酒醉的白人男子袭击了一个黑人，就跑去叫了警察。

source: When the cops arrived on the scene, they attacked the black man on the ground instead of his white attacker.
zh_cn: 当警察到达现场时，他们攻击了地上的黑人男子，而不是袭击他的白人。

source: Later, the young Rittenberg asked his aunt about it, wanting to know how the justice system could allow what he'd seen.
zh_cn: 后来，年轻的李敦白就此请教了他的姨妈，想要知道司法体制岂容他所看到的事情发生。

source: "She told me there was no such thing as justice, that you only get as much justice as you can pay for," he says, which shocked him.
zh_cn: 他说：“她告诉我，不存在公平正义这种东西，你只能得到和你的付出等价的公正。”这令他感到震惊。

source: "I'd grown up on stories where good always triumphed ­ I believed there had to be justice."
zh_cn: “我在正义总是胜利的故事下长大......我曾相信必定存在正义。”

source: Rittenberg turned down a scholarship to Princeton and studied philosophy at the University of North Carolina.
zh_cn: 李敦白拒绝了普林斯顿大学的奖学金，而选择了在北卡罗来纳大学学习哲学。

source: Moved by the conditions of local mill workers, he spent much of his early adulthood as a Southern labor and civil rights activist.
zh_cn: 动容于当地工厂工人的条件状况，他以一名南方劳工和民权活动者身份，度过了其相当部分的成年前期。

source: But after the outbreak of World War II, he was drafted into the Army and sent to Stanford's Army Far Eastern Language and Area School to learn Japanese.
zh_cn: 但第二次世界大战爆发之后，他应征加入军队，并被送往斯坦福的军队远东语言与地域学校学习日语。

source: When he arrived, he chose to learn Chinese instead - believing that learning Japanese would mean serving in the lengthy post-war occupation.
zh_cn: 在他到达时，他替而代之地选择了学习中文——认为学习日语会意味着，在漫长的战后占领期里被效用。

source: He wanted to return to the United States - and his labor activism - as soon as he possibly could.
zh_cn: 他想要回到美国——还有他的劳工运动中——尽快地。

source: He thought China would be a nice short adventure.
zh_cn: 他觉得中国会是一次不错的短期历险。

source: He wouldn't return to America for more than three decades.
zh_cn: 孰料，这一别竟会是30多年。

source: After his training and a journey across the Pacific, he and several linguists flew over "the Hump" from India to Kunming, China.
zh_cn: 结束受训，完成一段穿越太平洋的旅程之后，他与数名语言学家飞越了从印度到中国昆明的“驼峰航线”。

source: Their assignment - work with the American-allied Kuomintang government and assist with the post-war civil administration.
zh_cn: 他们的任务——和与美国结盟的国民党政府共事，在战后的民政管理上给予帮助。

source: China was indeed a beautiful country and a new adventure.
zh_cn: 中国的确是一个美丽的国家，和一次新的奇遇。

source: But the stench of hunger, poverty and corruption dampened the young southerner's enthusiasm.
zh_cn: 然而，令人不堪忍受的饥饿、穷困和腐败气息，浇湿了这个美国南部年轻人的热情。

source: Soon after he and his fellow troops arrived, they met a band of Kuomintang troops who offered to get them some female companionship.
zh_cn: 在他和他的同行部队到达后不久，他们遇到了一群国民党士兵，主动提出要让他们得到一些异性陪伴。

source: "They told us that for a dollar, they would go to a nearby village and bring back Chinese girls that they could guarantee would be virgins," Rittenberg says. "For one U.S. dollar, they would just grab some girl - everyone knew about it but nobody did anything to stop it."
zh_cn: “他们告诉我们，给一个美元，他们就会去附近的一个村子里，带些他们可以保证是处女的中国姑娘回来，”李敦白说，“为了一美元，他们就会去强抓某个女孩——人人都知道此事，但没有人试图去阻止它的发生。”

source: Officials hoarded food, money and supplies while peasants starved and toiled.
zh_cn: 官员们敛集食物、钱财，以及供给，而农民们忍饥挨饿，劳苦艰辛。

source: It was common to see corpses rotting along the roadside.
zh_cn: 沿路遇见尸体腐烂稀松平常。

source: Officials casually joked to him and the other Americans about robbing and torturing people.
zh_cn: 官员们随意地拿剥削和压迫别人，来与他和其他的美国人开玩笑。

source: "There was no incentive not to be corrupt - you almost had to be," he reflects.
zh_cn: “没有不贪腐的动机——你几乎不得不贪腐。”他认识到。

source: Government employees demanded bribes and kickbacks from common people f0r the most basic services.
zh_cn: 政府职员因为最基本的服务，而谋求从平民百姓身上获取贿赂和回扣。

source: "It was routine, people expected it."
zh_cn: “这是惯常，人们认为理所当然。”

source: One of the worst experiences was his investigation into the death of a 12-year-old Chinese girl named Li Muxian.
zh_cn: 最不堪的经历，是他对一个12岁的，名为李木仙（音译）的中国女孩的死亡调查。

source: A drunk American sergeant ran her down after a night of partying.
zh_cn: 一个酒醉的美国中士在一晚上的派对之后将其撞倒。

source: The G.I. had picked up a dancing girl at a club the night before, and woke up to find himself AWOL with a splitting headache.
zh_cn: 这个美国兵在前天晚上搭上了一个夜总会里的舞女，醒来发现自己头痛欲裂，已造成擅离职守。

source: He took a few shots of whiskey and drove back to base.
zh_cn: 他喝了几口威士忌，驾车回营地。

source: He saw Li by the road and thought it would be funny to scare her.
zh_cn: 他看到了马路边上的李，觉得吓唬吓唬她会是个乐子。

source: "I said to myself I'm going to see how close I can get to that little slopey girl and goddamn if I didn't run her over," the sergeant said in his deposition.
zh_cn: “我自言自语，看看我可以靠这个东亚小女孩多近，该死的，要是我没有从她身上压过去就好了。”这个中士在他的证词中说道。

source: Investigators sent Rittenberg to interview witnesses, including the girl's father. "Our life is nothing," the father said. "It is nothing but eating bitterness.
zh_cn: 调查人员指派李敦白去采访目击者，包括这个女孩的父亲。“我们的生活一无所有，”这位父亲说，“除了忍辱负重之外什么也没有。

source: She was all we had.
zh_cn: 她是我们的全部。

source: We were hoping she would have something better."
zh_cn: 我原本希望她的生活会有所改善。”

source: In his report, Rittenberg recommended the Army provide the highest possible compensation, but the assistant claims officer reduced it to $26.
zh_cn: 在他的报告中，李敦白建议军队能给予最大可能的补偿，但助理理赔官将其缩减到了26美元。

source: Rittenberg was mortified.
zh_cn: 李敦白感到了窘迫。

source: He told the officer that the Army had reimbursed a villager $150 for a horse not long before.
zh_cn: 他对这个官员说，军队前不久因为一匹马还赔偿了一个村民150美元。

source: The officer told him that the estimate was based on burial costs and what a person added to family income.
zh_cn: 这个官员告诉他，估价是以丧葬费和个人给家庭收入带来增益的情况为基础。

source: A small child earned no income and needed a just a small coffin, the officer reasoned.
zh_cn: 一个小孩子没有收入，且只需一副小棺木，这个官员推论。

source: A horse has a price tag - a human life doesn't.
zh_cn: 一匹马有标价——一个人的生命却没有。

source: Rittenberg delivered the $26 to the girl's father, feeling disgusted.
zh_cn: 李敦白将这26美元交付给了这个女孩的父亲，感到愤慨。

source: Later that day, the man arrived in his office.
zh_cn: 那天晚些时候，这个人来到了他的办公室。

source: The peasant had brought $6 back.
zh_cn: 这个农民带了6美元回来。

source: The American was confused.
zh_cn: 这个美国人感到不解。

source: The American linguist realized the man saw him as part of the corrupt Chinese bureaucracy.
zh_cn: 这个美国语言学者意识到，这个人将他视作了贪腐的中国官僚的一分子。

source: The peasant felt obligated to give a kickback to every official who helped him receive the meager compensation.
zh_cn: 这个农民觉得有必要，要给每个帮助过他得到这份微薄补偿的官员一点回扣。

source: Rittenberg refused to take the money, and sent the man on his way.
zh_cn: 李敦白拒绝接受，并将其送走。

source: The experience haunted him for years.
zh_cn: 这个经历给他留下的印记多少年也未曾褪去。

source: Exploring China
zh_cn: 探索中国

source: It was in Southwest China that Rittenberg began reading local newspapers - including underground newspapers glorifying the exploits of communist guerrillas in the north.
zh_cn: 在中国的西南地区，李敦白开始了阅读当地的报纸——包括赞颂北方共产党游击队英勇事迹的地方报纸。

source: Many newsstands carried these papers secretly, and the locals treated the guerrillas like folk heroes.
zh_cn: 许多报摊秘密地传递着这些报纸，当地人把这些游击队当作了民族英雄来看待。

source: "They seemed to be practicing honest government, and government that was somewhat democratic," he says.
zh_cn: “他们看起来推行的是诚信治理，以及有所民主的政府。”他说。

source: Around the same time, Rittenberg befriended several communists.
zh_cn: 差不多与此同时，李敦白结交了数位共产党人。

source: They shared meals, drank together and listened to music.
zh_cn: 他们同饮共食，聆听音乐。

source: They told him stories about underground revolutionary activities in Shanghai.
zh_cn: 他们给他讲关于上海地下革命活动的故事。

source: He requested a transfer to Shanghai for the remainder of his enlistment.
zh_cn: 他请求转移至上海，来完成他服役期的剩余部分。

source: His superior officers pulled some strings ­ and he was on his way.
zh_cn: 他的上级进行了操作......他得以启程。

source: Shanghai was a bustling international hub. "It was a chamber of horrors to me," Rittenberg says.
zh_cn: 上海是一个繁忙的国际中心。“它对我来说，是一个满是惊骇的场所。”李敦白说。

source: It was a decadent town - everything frightening about the corruption in Southwest China was amplified in this port city.
zh_cn: 这是个颓废的城市——在中国西南部涉及贪腐的每件骇人的事情，在这个港口城市里，得到了变本加厉。

source: "Nanking Road, which was the main stretch, was always crowded with people," he says. "Most of them were hookers and their pimps."
zh_cn: “作为主要路线的南京路，始终人头拥挤，”他说，“他们中的大多数是妓女和她们的皮条客。”

source: The opulence of the nightclubs clashed with the abject poverty and starvation on the streets.
zh_cn: 夜总会的富丽堂皇，与街面上凄惨的穷困和饥饿景象极不相称。

source: "You could hardly go anywhere without running into at least one body on the street."
zh_cn: “在街上，不管你走到哪里，几乎都会碰到一具以上的尸体。”

source: One morning, he opened the front door of his military lodging and found a corpse.
zh_cn: 一天早上，他打开军队寓所的前门，发现一具尸体。

source: "He was just sitting there, he'd frozen to death the night before," he recalls.
zh_cn: “他就坐在那里，被冻死在前晚。”他回忆。

source: He asked a Chinese policeman why nobody did anything about the bodies.
zh_cn: 他问一个中国警察，为什们没有人来处理这些尸体。

source: The cop explained to him that anyone who touched them would become responsible for the burial costs - so everyone would ignore it.
zh_cn: 这个警察向他解释说，谁碰了他们，谁就要承担丧葬费——所以每个人都当作没看到。

source: He took on a freelance assignment for an American press outlet investigating Shanghai's prostitution rackets.
zh_cn: 他承担了美国一家通讯社给予的一项独立任务，调查上海的妓女行业。

source: He learned that most of the prostitutes were sold to brothels from struggling rural families.
zh_cn: 他了解到，妓女中的大多数是从挣扎中的农村家庭被卖到了妓院里。

source: "A lot of them were just children," he reflected with a hint of sadness.
zh_cn: “她们中的很多还只是孩子。”他带着一丝痛心地回想道。

source: Shanghai was bad.
zh_cn: 上海状况恶劣。

source: But it wasn't all bad.
zh_cn: 但也不尽然。

source: Rittenberg met Soong Qingling, widow of the revolutionary Sun Yatsen.
zh_cn: 李敦白遇到了宋庆龄，革命人士孙中山的遗孀。

source: Both communists and nationalists revere Sun as the father of modern China, and Madame Soong was a power in her own right.
zh_cn: 共产党人和国民党人都尊崇孙为现代中国之父，并且宋女士凭其自身能力成为了一个具有影响力的人物。

source: "She was a very handsome lady with a lot of poise and presence," Rittenberg recalls.
zh_cn: “她是一位相当有风度和气质，非常端庄美丽的女士。”李敦白回忆说。

source: She introduced him to pro-democracy activists and artists in the city.
zh_cn: 她将他引见给了这个城市里支持民主的积极人士和艺术家。

source: Soong herself was a leftist sympathizer, and joined the communists after they took power a few years later.
zh_cn: 宋自己是一个左翼支持者，于共产党人掌权数年之后加入了他们。

source: Following his discharge from the Army, she became one of Rittenberg's mentors and helped him stay in China.
zh_cn: 随着李敦白从军队的退役，她成为了他的良师益友之一，并帮助他留在了中国。

source: He went to work for the United Nations Relief and Rehabilitation Administration, where he accounted for aid meant to alleviate famine.
zh_cn: 他去到了联合国善后救济总署（UNRRA）工作，在那里，他负责意在缓解饥荒的援助工作。

source: But as he traveled through the country, he witnessed more corruption and more abuse - even by fellow U.N. employees.
zh_cn: 但随着他在这个国家的游历，他见证了更严重的腐败与更深厚的沉疴——甚至是在同僚的联合国职员身上。

source: "We had flour coming in donated by the English speaking countries," he says. "[But] the rule was all relief went to the local Kuomintang benevolence association and they would give it out."
zh_cn: “我们接收到了英语国家捐赠的面粉，”他说，“但普遍情况是，所有的救济都到了当地的国民党慈善协会那里，并由他们来分发。”

source: Unsurprisingly, these associations were often corrupt. "They would put it in their back pocket," he explains. "They'd sell it for profit, exporting to places like Manila or Singapore.
zh_cn: 不出意外，这些协会往往存在贪腐现象。“他们会把它占为己有，”他解释说，“他们会把它卖掉以得利，外销到像马尼拉和新加坡这样的地方。

source: We would often end up buying back our own relief agency's flour."
zh_cn: 到头来，我们经常会买回我们的救济机构自己的面粉。”

source: The scale of corruption, in Rittenberg's view, had a lot to do with driving people into the communist movement.
zh_cn: 这种贪腐的程度，在李敦白看来，与逼迫人们加入共产主义运动大有关联。

source: The nationalists hoarded American aid and centralized their power in the cities, while the communists won popular support in the countryside.
zh_cn: 国民党囤积了美国的救济，并且将其势力集中于城市，而共产党在农村赢得了广泛的支持。

source: At one point, he visited a town called Fresh Flower Village, where communists and nationalists were negotiating under the eyes of American officers.
zh_cn: 有一次，他造访了一个名为鲜花村的村庄。在此，国民党与共产党正当着美国官员的面进行谈判。

source: The nationalists had blocked aid to the communist-held village.
zh_cn: 国民党封锁了对共产党占领区的援助。

source: U.S. Gen. George C. Marshall - America's top Army officer during World War II - was in China brokering the negotiations.
zh_cn: 美国的马歇尔将军——二战期间美国军队的最高长官——正在中国进行谈判斡旋。

source: He ordered the nationalists to end the blockade.
zh_cn: 他要求国民党停止封锁。

source: However, an American general told Rittenberg that when the Americans left, the nationalists would return and wipe out the village.
zh_cn: 然而，美国的一位将军告诉李敦白，到美国人离开之时，国民党会回来摧毁这个村庄。

source: It flew in the face of the stated U.S. policy of working to form a coalition government between the two factions.
zh_cn: 悍然不顾美国已得到公认的，致力于建立由两个党派共同参与的联合政府的策略。

source: The general's attitude disturbed him.
zh_cn: 这个将军的态度令他不安。

source: A U.S. Army colonel took over the negotiations, and Rittenberg didn't believe he knew of the scheme.
zh_cn: 美国军队的一位上校接棒了这次谈判，李敦白不相信他知道这其中的阴谋。

source: But the American aid worker became increasingly distrustful of official statements.
zh_cn: 但这位美国的援助工作者，在不断地丧失对官方言论的信任。

source: He believed the U.S. government was lying to both the American and Chinese people - and acted in a way he considered un-American.
zh_cn: 他认为美国政府同时在欺骗着美国和中国的人民——并且表现以一种非美国式的方式。

source: Meeting Mao
zh_cn: 与毛结识

source: Unable to handle the corruption, Rittenberg left his job at UNRRA in the fall of 1946.
zh_cn: 因无法处理贪腐问题，李敦白在1946年秋天辞去了他在UNRRA的工作。

source: He wasn't the only one.
zh_cn: 他不是唯一的一个。

source: The Kuomintang's excesses led increasing numbers of Americans in China to sympathize with the communists.
zh_cn: 国民党的无底线行径致使越来越多在中国的美国人，在情感上站到了共产党一边。

source: "But probably not to the extent that I did."
zh_cn: “不过，可能没有到我这种程度。”
